package Lesson_22_HTTP_protocol.My;

//Протокол передачи гипертекста (HyperText Transfer Protocol - HTTP) - это прикладной протокол для передачи гипертекстовых документов, таких как HTML.
// Он создан для связи между веб-браузерами и веб-серверами, хотя в принципе HTTP может использоваться и для других целей.
// Протокол следует классической клиент-серверной модели, когда клиент открывает соединение для создания запроса, а затем ждёт ответа.
// HTTP - это протокол без сохранения состояния, то есть сервер не сохраняет никаких данных (состояние) между двумя парами "запрос-ответ".
// Несмотря на то, что HTTP основан на TCP/IP, он также может использовать любой другой протокол транспортного уровня с гарантированной доставкой.

//https://developer.mozilla.org/ru/docs/Web/HTTP

public class Main {
    public static void main(String[] args) {

        String почитать_про_HTTP = "https://developer.mozilla.org/ru/docs/Web/HTTP";
    }
}
